<?php  if ( ! defined('BASEPATH')) exit('No direct script access allowed');
/*
| -------------------------------------------------------------------
| 自动加载器
| -------------------------------------------------------------------
| 该文件指定系统默认加载的类文件
|
| 为了保持框架的轻量级，在这里只加载必要的类文件，以最小原则配置。
|
| -------------------------------------------------------------------
| 目录
| -------------------------------------------------------------------
|
| 可自动加载的类型：
|
| 1. 包 Packages
| 2. 类库 Libraries
| 3. 帮助类 Helper files
| 4. 自定义配置文件 Custom config files
| 5. 语言文件 Language files
| 6. 数据模型 Models
|
*/

/*
| -------------------------------------------------------------------
|  自动加载 包
| -------------------------------------------------------------------
| 示例:
|
|  $autoload['packages'] = array(APPPATH.'third_party', '/usr/local/shared');
|
*/

$autoload['packages'] = array();


/*
| -------------------------------------------------------------------
|  自动加载 类库
| -------------------------------------------------------------------
| 这里的类库可位于 system/libraries 目录或 application/libraries 目录
|
| 示例:
|
|	$autoload['libraries'] = array('database', 'session', 'xmlrpc');
*/

$autoload['libraries'] = array();


/*
| -------------------------------------------------------------------
|  自动加载 辅助类文件
| -------------------------------------------------------------------
| 示例:
|
|	$autoload['helper'] = array('url', 'file');
*/

$autoload['helper'] = array();


/*
| -------------------------------------------------------------------
|  自动加载 配置文件
| -------------------------------------------------------------------
| 示例:
|
|	$autoload['config'] = array('config1', 'config2');
|
| 注意：这里只用于你创建了自定义配置文件，否则保留为空。
|
*/

$autoload['config'] = array();


/*
| -------------------------------------------------------------------
|  自动加载 语言文件
| -------------------------------------------------------------------
| 示例:
|
|	$autoload['language'] = array('lang1', 'lang2');
|
| 注意：在文件名中不要包含 "_lang" 部分。
| 例如："codeigniter_lang.php" 只需包含 array('codeigniter');
|
*/

$autoload['language'] = array();


/*
| -------------------------------------------------------------------
|  自动加载 数据模型
| -------------------------------------------------------------------
| 示例:
|
|	$autoload['model'] = array('model1', 'model2');
|
*/

$autoload['model'] = array();


/* 文件结束，禁止此行后或之下添加任何东西 */
